app/Controllers/DespesasController.php

SELECT *
FROM `despesas`
---
    public function index()
    {
        $despesas = new Despesas();
        $data['despesas'] = $despesas->findAll();

INSERT INTO `despesas` (`descricao`, `valor`, `data`) VALUES ('Aluguel', '800', '2024-01-25')
---
    public function store()
    {
        $despesas = new Despesas();
        $despesas->insert([
            'descricao' => $this->request->getVar('descricao'),
            'valor' => $this->request->getVar('valor'),
            'data' => $this->request->getVar('data')
        ]);

SELECT *
FROM `despesas`
WHERE `despesas`.`id` = '3'
---
    public function edit($id)
    {
        $despesas = new Despesas();
        $data['despesa'] = $despesas->find($id);

DELETE FROM `despesas`
WHERE `id` IN ('3')
---
    public function delete($id)
    {
        $despesas = new Despesas();
        $despesas->delete($id);